## Plan Result (ithc-uksouth-ithc)




<pre><code>Plan: 88 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.public-dns.azurerm_dns_a_record.this[&#34;ctscmail&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;_404182799e5e3fefe26b09d10f47bce9&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;administer-orgs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;adoption-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.administer-orgs&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.adoption-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.bar&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.benefit-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.c100-application&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.civil-citizen-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fact&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fact-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.fees-register&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.gateway-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.immigration-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.lau&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.manage-case&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.manage-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.moneyclaims&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.moneyclaims-legal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.nfdiv&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.paybubble&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.pcq&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.pip-frontend&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.privatelaw&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.probate&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.register-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.return-case-doc-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.rpts&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.sds-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.sscs-cor&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;afdverify.toffee&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;bar&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;benefit-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;c100-application&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;ccpay-bubble&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cdnverify.idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;cft-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;civil-citizen-ui&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;decree-absolute-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;decree-nisi-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;em8016.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fact&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fact-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;fees-register&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;gateway-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-user-dashboard&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-admin&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;idam-web-public&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;immigration-appeal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;lau&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;manage-case&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;manage-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;moneyclaims&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;moneyclaims-legal&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv-apply-for-divorce&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;nfdiv-end-civil-partnership&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;paybubble&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;paymentoutcome-web&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;pcq&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;petitioner-frontend-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;pip-frontend&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;plum&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;privatelaw&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;probate&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;register-org&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;respond-divorce-aks&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;return-case-doc-ccd&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;rpts&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s1._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;s2._domainkey.mail-prl-nonprod&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;sds-api-mgmt&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;sscs-cor&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;tmmanage.appeal-benefit-decision&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;tmsscs-tribunals-frontend&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;toffee&#34;]
  * module.public-dns.azurerm_dns_cname_record.this[&#34;www.paymentoutcome-web&#34;]
  * module.public-dns.azurerm_dns_mx_record.this[&#34;contact.justice&#34;]
  * module.public-dns.azurerm_dns_txt_record.this[&#34;_dmarc.contact.justice&#34;]
  * module.public-dns.azurerm_dns_txt_record.this[&#34;contact.justice&#34;]
  * module.public-dns.azurerm_dns_zone.zone
  * module.public-dns.azurerm_role_assignment.dnszonecontributer




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.public-dns.azurerm_dns_a_record.this["ctscmail"] will be created
  + resource "azurerm_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ctscmail"
      + records             = [
          + "51.104.202.183",
        ]
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["_404182799e5e3fefe26b09d10f47bce9"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_404182799e5e3fefe26b09d10f47bce9"
      + record              = "17C2322AA10D8E2E87769BDD1EBC28EC.B245DB1A1DB26037B07B508290FC32A6.e56dbe0f3e1c9cecf699.comodoca.com."
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["administer-orgs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "administer-orgs"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["adoption-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "adoption-web"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.administer-orgs"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.administer-orgs"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.adoption-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.adoption-web"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.bar"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.bar"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.benefit-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.benefit-appeal"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.c100-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.c100-application"
      + record              = "afdverify.sdshmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.cft-api-mgmt"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.civil-citizen-ui"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.civil-citizen-ui"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.fact"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.fact"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.fact-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.fact-admin"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.fees-register"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.fees-register"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.gateway-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.gateway-ccd"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-user-dashboard"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-web-admin"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.idam-web-public"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.immigration-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.immigration-appeal"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.lau"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.lau"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.manage-case"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.manage-case"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.manage-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.manage-org"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.moneyclaims"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.moneyclaims"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.moneyclaims-legal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.moneyclaims-legal"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.nfdiv"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.nfdiv"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.paybubble"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.paybubble"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.pcq"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.pcq"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.pip-frontend"
      + record              = "afdverify.sdshmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.plum"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.privatelaw"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.privatelaw"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.probate"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.probate"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.register-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.register-org"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.return-case-doc-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.return-case-doc-ccd"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.rpts"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.rpts"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sds-api-mgmt"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.sscs-cor"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.sscs-cor"
      + record              = "afdverify.hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["afdverify.toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "afdverify.toffee"
      + record              = "afdverify.sdshmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["bar"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "bar"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["benefit-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "benefit-appeal"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["c100-application"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "c100-application"
      + record              = "sdshmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["ccpay-bubble"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "ccpay-bubble"
      + record              = "11d1facb-25d7-49ef-a8dc-d698479270a2.cloudapp.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cdnverify.idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cdnverify.idam-web-public"
      + record              = "cdnverify.hmcts-idam-web-public-shutter-ithc.azureedge.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["cft-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "cft-api-mgmt"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["civil-citizen-ui"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "civil-citizen-ui"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["decree-absolute-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-absolute-aks"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["decree-nisi-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "decree-nisi-aks"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["em8016.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "em8016.mail-prl-nonprod"
      + record              = "u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["fact"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fact"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["fact-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fact-admin"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["fees-register"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "fees-register"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["gateway-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "gateway-ccd"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-user-dashboard"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-user-dashboard"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-web-admin"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-admin"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["idam-web-public"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "idam-web-public"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["immigration-appeal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "immigration-appeal"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["lau"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "lau"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["manage-case"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-case"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["manage-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "manage-org"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["moneyclaims"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "moneyclaims"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["moneyclaims-legal"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "moneyclaims-legal"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["nfdiv"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["nfdiv-apply-for-divorce"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv-apply-for-divorce"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["nfdiv-end-civil-partnership"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "nfdiv-end-civil-partnership"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["paybubble"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paybubble"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["paymentoutcome-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "paymentoutcome-web"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["pcq"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pcq"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["petitioner-frontend-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "petitioner-frontend-aks"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["pip-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "pip-frontend"
      + record              = "sdshmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["plum"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "plum"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["privatelaw"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "privatelaw"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["probate"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "probate"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["register-org"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "register-org"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["respond-divorce-aks"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "respond-divorce-aks"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["return-case-doc-ccd"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "return-case-doc-ccd"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["rpts"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "rpts"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["s1._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s1._domainkey.mail-prl-nonprod"
      + record              = "s1.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["s2._domainkey.mail-prl-nonprod"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "s2._domainkey.mail-prl-nonprod"
      + record              = "s2.domainkey.u24999805.wl056.sendgrid.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + record              = "sdshmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["sscs-cor"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sscs-cor"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["tmmanage.appeal-benefit-decision"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tmmanage.appeal-benefit-decision"
      + record              = "590582cd-441a-4601-9f6a-f8203d4c19fe.cloudapp.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 60
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["tmsscs-tribunals-frontend"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "tmsscs-tribunals-frontend"
      + record              = "590582cd-441a-4601-9f6a-f8203d4c19fe.cloudapp.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_cname_record.this["www.paymentoutcome-web"] will be created
  + resource "azurerm_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "www.paymentoutcome-web"
      + record              = "hmcts-ithc.azurefd.net"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 300
      + zone_name           = "ithc.platform.hmcts.net"
    }

  # module.public-dns.azurerm_dns_mx_record.this["contact.justice"] will be created
  + resource "azurerm_dns_mx_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "contact.justice"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"

      + record {
          + exchange   = "ctscmail.ithc.platform.hmcts.net"
          + preference = "10"
        }
    }

  # module.public-dns.azurerm_dns_txt_record.this["_dmarc.contact.justice"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "_dmarc.contact.justice"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"

      + record {
          + value = "v=DMARC1; p=none"
        }
    }

  # module.public-dns.azurerm_dns_txt_record.this["contact.justice"] will be created
  + resource "azurerm_dns_txt_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "contact.justice"
      + resource_group_name = "reformmgmtrg"
      + ttl                 = 3600
      + zone_name           = "ithc.platform.hmcts.net"

      + record {
          + value = "v=spf1 ip4:51.145.107.152  ip4:51.145.123.93 -all"
        }
    }

  # module.public-dns.azurerm_dns_zone.zone will be created
  + resource "azurerm_dns_zone" "zone" {
      + id                        = (known after apply)
      + max_number_of_record_sets = (known after apply)
      + name                      = "ithc.platform.hmcts.net"
      + name_servers              = (known after apply)
      + number_of_record_sets     = (known after apply)
      + resource_group_name       = "reformMgmtRG"

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.public-dns.azurerm_role_assignment.dnszonecontributer will be created
  + resource "azurerm_role_assignment" "dnszonecontributer" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "457aabff-86ec-49cc-9b77-6b7b59420356"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "DNS Zone Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 88 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":958,"Program":"tfcmt","SHA1":"","Target":"ithc-uksouth-ithc","Vars":{}} -->